// Задание 8 по теме 1.7
// Необходимо создать двумерный массив 5 х 5. Далее написать функцию, которая заполнит его случайными числами от 30 до 60. 
// Создать еще две функции, которые находят максимальный и минимальный элементы этого двумерного массива. 
// gcc версия 4.4.7 20120313 (Red Hat 4.4.7-23) (GCC)
#include <iostream>

int array[5,5]

int FillRandom()
{
}

min FillRandom()
{
}

max FillRandom()
{
}


int main()
{
   int year;
   std::cout << "Введите год: ";
   std::cin >> year;
   if (IsLeapYear(year))
       std::cout << "Этот год високосный.\n";
   else
       std::cout << "Этот год не високосный.\n";
   return 0;
}